ГТС/УТГТС/Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Партнеры</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<Comment>Используется для группировки по территориальному признаку</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиенты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>Поставщики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Публичное наименование, например, для печати или устного обращения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<Comment>Конкуренты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<Comment>Прочие отношения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживаетсяТорговымиПредставителями</Name>
					<Comment>Обслуживаются торговыми представителями</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлиента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>сег_Дилер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.сег_Сегменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Comment>Перевозчики</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПереработчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлассаКлиента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыКлассаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецценаUSD</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндивидуальныйВидЦены</Name>
					<Comment>Уточняющий или индивидуальный вид цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/Catalogs/МаркетинговыеМероприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МаркетинговыеМероприятия</Name>
			<Comment>Произвольные комментарии к мероприятию</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.КаналыРекламныхВоздействий</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментПартнеров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПартнерыИКонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольПартнера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиПартнеровВСделкахИПроектах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/CommonForms/ПростыеЗвонки_ВходящийЗвонок/Ext/Form/Module.bsl
&НаКлиенте
Процедура Перезвонить(Команда)
	
	ПростыеЗвонки_ОбщийМодуль_Клиент.Позвонить(НомерТелефона);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьВБуфер(Команда)
	
	HTML = Новый COMОбъект("htmlfile");
	HTML.parentWindow.clipboardData.setData("Text",НомерТелефона);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиВЯндекс(Команда)
	
	ПредставлениеНомера = СокрЛП(СтрЗаменить(НомерТелефона," ","+"));
	
	ЗапуститьПриложение("http://yandex.ru/yandsearch?text="+ПредставлениеНомера);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НашНомер = "";
	//НашНомер = "временно недоступно";
	ПроверитьТелНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НомерТелефона = Параметры.НомерТелефона;
	
	Местонахождение = "";
	ПредставлениеНомера = ПростыеЗвонки_ОбщийМодуль_Сервер.ПолучитьПредставлениеНомераТелефона(НомерТелефона,Местонахождение);
	
	
	НомерТелефона= ПредставлениеНомера;
	
	Если ПустаяСтрока(Местонахождение) Тогда
		
		Местонахождение = " не удалось определить";
		
	Иначе
		
		Местонахождение = " "+Местонахождение;
		
	КонецЕсли;
	
	Заголовок = "Входящий звонок в "+Формат(ТекущаяДата(),"ДЛФ=T");
	
	
	//ASP. Вызываю процедуру поиска клиента в базе - в зависимости от того найден ли показываю соотвествующую страницу формы 	
	СтруктураКлиентов = ПростыеЗвонки_ОбщийМодуль_Сервер.ПолучитьКлиентаПоНомеруТелефона(Параметры.НомерТелефона);
	ТекущаяСтраница=Элементы.ГруппаСтраницаДействийНомерЕстьВБазе;
	
	Если ЗначениеЗаполнено(СтруктураКлиентов.Партнер) Тогда
		Абонент=СтруктураКлиентов.Партнер;
		//ГТС выводим менеджера
		ОсновнойМенеджер="Менеджер: " + Строка(Абонент.ОсновнойМенеджер);
	ИначеЕсли  ЗначениеЗаполнено(СтруктураКлиентов.Контрагент) Тогда
		Абонент=СтруктураКлиентов.Контрагент;
		ОсновнойМенеджер="Менеджер: " + Строка(Абонент.Партнер.ОсновнойМенеджер);
	Иначе 
		ТекущаяСтраница=Элементы.ГруппаСтраницаДействийНомераНетВБазе;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СтруктураКлиентов.КонтактноеЛицо) Тогда
		КонтактноеЛицо=СтруктураКлиентов.КонтактноеЛицо;
	КонецЕсли;
	
	Элементы.ГруппаСтраницыДействийФормы.ТекущаяСтраница=ТекущаяСтраница;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПартнера(Команда)
	
	ПараметрФормыПартнера = Новый Структура;
	ПараметрФормыПартнера.Вставить("Ключ", Неопределено);
	
	СтруктураЗначенийЗаполнения = Новый Структура;
	СтруктураЗначенийЗаполнения.Вставить("ПростыеЗвонки_НомерТелефона",НомерТелефона);
	
	ПараметрФормыПартнера.Вставить("ЗначенияЗаполнения",СтруктураЗначенийЗаполнения);
	
	ПолучитьФорму("Справочник.Партнеры.ФормаОбъекта", ПараметрФормыПартнера).Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьКонтактноеЛицо(Команда)
	
	ПараметрФормыКонтактногоЛица = Новый Структура;
	ПараметрФормыКонтактногоЛица.Вставить("Ключ", Неопределено);
	
	СтруктураЗначенийЗаполнения = Новый Структура;
	СтруктураЗначенийЗаполнения.Вставить("ПростыеЗвонки_НомерТелефона",НомерТелефона);
	
	ПараметрФормыКонтактногоЛица.Вставить("ЗначенияЗаполнения",СтруктураЗначенийЗаполнения);
	//ASP. Откроем форму нового контактного лица - документ телефонный звонок запишем после получения оповещения о том что контактное лицо записано 	
	ОткрытьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаОбъекта", ПараметрФормыКонтактногоЛица,ЭтаФорма);
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАбонента(Команда)
	СоздатьДокументТелефонныйЗвонокПоПараметрамЗвонка();
	ОткрытьЗначение(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСделку(Команда)
	СоздатьДокументТелефонныйЗвонокПоПараметрамЗвонка();
	//ASP. Передаем в форму новой сделки партнера и ссылку на документ телефонный звонок
	ОткрытьФорму("Справочник.СделкиСКлиентами.Форма.ФормаЭлемента",Новый Структура("ДокументТелефонныйЗвонок,Партнер",ДокументТелефонныйЗвонок,Абонент));	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоследнююСделку(Команда)
	СоздатьДокументТелефонныйЗвонокПоПараметрамЗвонка();
	
	ПоследняяСделка=ПолучитьПоследнююСделку(Абонент);
	Если ПоследняяСделка=Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдено сделок по партнеру");
	Иначе
		ОткрытьЗначение(ПоследняяСделка)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСохранивЗвонок(Команда)
	СоздатьДокументТелефонныйЗвонокПоПараметрамЗвонка();
	Закрыть();	
КонецПроцедуры

&НаКлиенте
Процедура НеУчитывать(Команда)
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура СоздатьДокументТелефонныйЗвонокПоПараметрамЗвонка()
	//ASP. Для того что бы исключить дублирование проверяем что документ телефонный звонок не создан и создаем новый
	Если ДокументТелефонныйЗвонок=ПредопределенноеЗначение("Документ.ТелефонныйЗвонок.ПустаяСсылка") Тогда
		ДокументТелефонныйЗвонок=ПростыеЗвонки_ОбщийМодуль_Сервер.СоздатьДокументТелефонныйЗвонок(НомерТелефона,Параметры.НомерНа,Параметры.ПараметрыНаправление,Параметры.ДатаВремяНачала,Параметры.ДатаВремяОкончания);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнююСделку(Партнер)
	
	ЗапросПолученияПоследнейСделки = Новый Запрос;
	ЗапросПолученияПоследнейСделки.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СделкиСКлиентами.Ссылка КАК Сделка
	|ИЗ
	|	Справочник.СделкиСКлиентами КАК СделкиСКлиентами
	|ГДЕ
	|	СделкиСКлиентами.Партнер = &Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	СделкиСКлиентами.ДатаНачала УБЫВ";
	ЗапросПолученияПоследнейСделки.УстановитьПараметр("Партнер",Партнер);
	
	
	
	РезультатЗапросаПолученияПоследнейСделки = ЗапросПолученияПоследнейСделки.Выполнить();
	
	Если РезультатЗапросаПолученияПоследнейСделки.Пустой() Тогда
		Возврат Неопределено
	Иначе
		ВыборкаЗапросаПолученияПоследнейСделки=РезультатЗапросаПолученияПоследнейСделки.Выбрать();
		ВыборкаЗапросаПолученияПоследнейСделки.Следующий();
		Возврат ВыборкаЗапросаПолученияПоследнейСделки.Сделка;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	//ASP. После записи нового контактного лица запишем документ телефонный звонок в базу
	СоздатьДокументТелефонныйЗвонокПоПараметрамЗвонка();
КонецПроцедуры

//Определение номера на который звонят и рекламы с которой
//&НаКлиенте
//Процедура Проверка()
//	ОтключитьОбработчикОжидания("Проверка");
//    ПроверитьТелНаСервере();
//КонецПроцедуры

&НаСервере
Процедура ПроверитьТелНаСервере()
	ЕСЛИ Параметры.НомерС = "84951518934" ИЛИ Параметры.НомерС = "84951518985" ИЛИ Параметры.НомерС = "84951518632"
	ТОГДА
	  Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0--00000003");
	  НашНомер = "Рекламная кампания: 8 АВИТО";
	ИНАЧЕ
		//НомерТел = "<I>"+Параметры.НомерС;	
		//Текст = Новый ТекстовыйДокумент;
		//Попытка
		//    Текст.Прочитать("\\172.16.0.28\pbx1$\PbxCollect01.log");
		//Исключение
		//    Возврат;
		//КонецПопытки;
		//Вызываемый = Параметры.Наш;
		//НомерСтроки = Текст.КоличествоСтрок();
		//Пока НомерСтроки > 0 И Вызываемый = "" Цикл
		//	Стр= ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(Текст.ПолучитьСтроку(НомерСтроки));
		//	Позиция = Найти(Стр,НомерТел);
		//	Если Позиция>0 Тогда
		//                    Вызываемый = Сред(Стр, Позиция-7, 7);
		//					
		//	КонецЕсли; 
		//	НомерСтроки = НомерСтроки -1;
		//КонецЦикла;
		Вызываемый = Прав(Параметры.line, 7);
		Если Вызываемый = "7887786"  ИЛИ Вызываемый = "6486742" ИЛИ Вызываемый = "6779579" ИЛИ Вызываемый = "2880093"
			//ИЛИ Вызываемый = "7889934"
			// ИЛИ Вызываемый = "7853787"  ИЛИ Вызываемый = "7889927"  ИЛИ Вызываемый = "7889936" ИЛИ Вызываемый = "7880326"
			 Тогда
			 НашНомер = "ГТС: Общие номера компании"
		//ИначеЕсли
		//	 Вызываемый = "7853795"
		//	 Тогда
		//	 Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("000000016  ");
		//	 НашНомер = "ГТС: Маркетинг";
		ИначеЕсли
			 Вызываемый = "1101597"
			 Тогда
			 Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0--00000012");
			 НашНомер = "Лендинг: SMART-TELEGA.RU";
		ИначеЕсли
			 Вызываемый = "6539234"
			 Тогда
			 Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0--00000008");
			 НашНомер = "Лендинг: SMART-STELLAG.RU";
		ИначеЕсли
			 Вызываемый = "2880681"
			 Тогда
			 Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0--00000005");
			 НашНомер = "Лендинг: SMART-SHTABELER.RU";
		ИначеЕсли
			 Вызываемый = "5206982"
			 Тогда
			 Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0--00000014");
			 НашНомер = "Лендинг: SMART-STELLAZH.RU";
		ИначеЕсли
			 Вызываемый = "7807416"
			 Тогда
			 Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("000000018  ");
			 НашНомер = "Лендинг: SMART-STELLAZH.RU РЕГИОНЫ";
		ИначеЕсли
			 Вызываемый = "4253462"
			 Тогда
			 НашНомер = "ГТС: Санкт-Петербург";
		ИначеЕсли
			 Вызываемый = "3201031"
			 Тогда
			 НашНомер = "Ростов-на-Дону: спросите сайт (rnd.***)";
		//ИначеЕсли
		//	 Вызываемый = "7880339" ИЛИ Вызываемый = "7880365"
		//	 Тогда
		//	 Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("000000005  ");
		//	 НашНомер = "Сайты: SKLADCOMFORT";
		//ИначеЕсли
		//	 Вызываемый = "7807446"
		//	 Тогда
		//	 //Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0--00000012");
		//	 НашНомер = "Лендинг: SMART-LEBEDKA.RU";	 
		ИначеЕсли
			 Вызываемый = "2882431"
			 Тогда
			 Мероприятие = Справочники.МаркетинговыеМероприятия.НайтиПоКоду("000000005  ");
			 НашНомер = "ГТС: Нижний Новгород";
		ИначеЕсли
			 Вызываемый = "2882789"
			 Тогда
			 НашНомер = "Переадресация со старых номеров";
		Иначе
			НашНомер = "Не определено";

		КонецЕсли;
КОНЕЦЕСЛИ;
КонецПроцедуры
